---
kind: method
id: M:Autodesk.Revit.DB.TypeBinding.#ctor
source: html/e3703709-21a8-686f-282a-031a1d8fd3fc.htm
---
# Autodesk.Revit.DB.TypeBinding.#ctor Method

Constructs an empty type binding.

## Syntax (C#)
```csharp
public TypeBinding()
```

## Remarks
Categories can be set a later time by using the Categories property of this object.